In [2]:
#functiona programming

In [4]:
def check_palidrome(word):
    return word

In [6]:
check_palidrome('nitin')

'nitin'

In [12]:
a = 'nitin'
a[::-1]

'ykcul'

In [20]:
a = 'nitin'
if a == a[::-1]:
    print(f' {a} is a palidrome')
else:
    print('not a palindrome')

 nitin is a palidrome

In [32]:
def check_palidrome(word):
    if word == word[::-1]:
        print(f' {a} is a palidrome')
    else:
        print(f'{a} not a palindrome')
    
    
check_palidrome('nitin')

 nitin is a palidrome

In [38]:
def check_palidrome(word):
    word = word.upper()
    if word == word[::-1]:
        print(f' {a} is a palidrome')
    else:
        print(f'{a} not a palindrome')
    
    
check_palidrome('Nitin')

 nitin is a palidrome

In [9]:
def check_palidrome(word):
    if type(word) == str:
        word = word.upper()
        
        if word == word[::-1]:
            print(f' {word} is a palidrome')
        else:
            print(f'{word} not a palindrome')
    else:
        return 'invalid data type'


check_palidrome('ash')

ASH not a palindrome

In [48]:
#fibonacciiii

In [78]:
def give_fibo(n):
    fibo = [0,1]
    for i in range(n-2):
        last_num = fibo[-1]
        second_last_num = fibo[-2]
        next_num = last_num + second_last_num
        fibo.append(next_num)
        
    return fibo   
        
print(give_fibo(22))

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946]

In [52]:
data  = [56,45,63,78]
print(data[-1])

78

In [96]:
def check_prime(number):
    for i in range(2,number):
        if number%i == 0:
            print(f'{number } is not a prime number')
            break
    else:
        print(f'{number} is a prime number')
check_prime(13)

13 is a prime number

In [100]:
n = 5.0
print('hello ' * int(n))

hello hello hello hello hello

In [106]:
n = 5
for i in range(1,n+1):
    print(i * '* ')

*
* *
* * *
* * * *
* * * * *

In [118]:
n = 5
for i in range(1,n+1):
    print(' ' *(n-i) + i*'*  ')

    *
   *  *
  *  *  *
 *  *  *  *
*  *  *  *  *

In [2]:
def star(n,typ = 'left'):
    if typ == 'left':
        space = ''
    elif typ == 'right':
        space = '  '
    elif typ == 'centre':
        space =' '
    for i in range(1,n+1):
        print(space *(n-i) + i*'$ ')
star(10,'left')

$
$ $
$ $ $
$ $ $ $
$ $ $ $ $
$ $ $ $ $ $
$ $ $ $ $ $ $
$ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $

In [3]:
def star(n,typ = 'left',shape = '*'):
    if typ == 'left':
        space = ''
    elif typ == 'right':
        space = '  '
    elif typ == 'centre':
        space =' '
    for i in range(1,n+1):
        print(space *(n-i) + i*f'{shape} ')
star(10,'centre','iitm')

         iitm
        iitm iitm
       iitm iitm iitm
      iitm iitm iitm iitm
     iitm iitm iitm iitm iitm
    iitm iitm iitm iitm iitm iitm
   iitm iitm iitm iitm iitm iitm iitm
  iitm iitm iitm iitm iitm iitm iitm iitm
 iitm iitm iitm iitm iitm iitm iitm iitm iitm
iitm iitm iitm iitm iitm iitm iitm iitm iitm iitm

In [152]:
def sum_of_n(n):
    result = 0
    for i in range(1,n+1):
        result += i
    return result    

sum_of_n(10)

55

In [2]:
def factorial(n):
    result = 1
    for i in range(1,n+1):
        result *= i
    return result
factorial(5)

120

In [2]:
def total_sales(*args):  #star * means we can pass more than one arguments and helps in unpacking
    print(args)
total_sales(1,2,4)

(1, 2, 4)

In [4]:
def total_s(*args):
    result = 0
    for i in args:
        result += i
    return result
total_s(1,5,69,36)

111

In [10]:
sales = [456,585,566,233,489,266,333]
min_element = sales[0]
for i in sales[1:]:
    if i < min_element:
        min_element = i
print(min_element)

233

In [40]:
def minin(*sales):
    min_element = sales[0]
    for i in sales[1:]:
        if i < min_element:
            min_element = i
    return min_element   

minin(12,20,36,58,55)

12

In [42]:
def maxim(*sales):
    max_element = sales[0]
    for i in sales[1:]:
        if i > max_element:
            max_element = i
    return max_element    

maxim(12,20,36,58,55,500)

500

In [55]:
company = ['ola','uber','rapido','adani','tata']
def add_hashtag(*company):
    result = []
    for i in company:
        result.append('#'+i.upper())
    return result
add_hashtag(*company)

['#OLA', '#UBER', '#RAPIDO', '#ADANI', '#TATA']

In [61]:
def store_records(name,age,sec,roll_no,Class):
    data = {
        'Name' : name, 'Age' : age, 'Sec' : sec, 'Roll no' : roll_no, 'Class' : lass}
    import pandas as pd
    result = pd.DataFrame(data,index = [1])
    return result
store_records('mohan',21,'a',12,12)
store_records('maan',21,'a',12,12)
store_records('mpaan',21,'a',12,12)

    Name  Age Sec  Roll no  Class
1  mpaan   21   a       12     12

In [18]:
def student_records(**kwargs):
    import pandas as pd
    try:
        result = pd.DataFrame(kwargs)
        return result
    except:
        result = pd.DataFrame(kwargs,index=[1])
        return result

      Name  Age  Roll_no Address
0  ashmeet   20       10   delhi
1     ashh   30       12  mumbai
2    singh   40       33     goa

In [20]:
student_records(Name= ['ashmeet','ashh','singh'],
                Age = [20,30,40],
                Roll_no = [10,12,33],
                Address =['delhi','mumbai','goa'])

      Name  Age  Roll_no Address
0  ashmeet   20       10   delhi
1     ashh   30       12  mumbai
2    singh   40       33     goa